<a href="https://colab.research.google.com/github/qa21336/HousingStatisticsAnalysis-/blob/main/inflation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# Path to the Excel file
file_path = 'statistic_id306648_inflation-rate-in-the-uk-1989-2024.xlsx'

# Assuming the data is in the first sheet, and the first row is the header
# Adjust 'sheet_name' and 'header' as needed
df = pd.read_excel(file_path, sheet_name=1, header=0)

In [ ]:
a = df.head(5)
print(a.info())
a

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  0 non-null      float64
 1   Unnamed: 1  3 non-null      object
 2   Unnamed: 2  1 non-null      float64
 3   Unnamed: 3  1 non-null      object
dtypes: float64(2), object(2)
memory usage: 288.0+ bytes
None

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3
0,NaN,NaN,NaN,NaN
1,NaN,Inflation rate in the UK 1989-2024,NaN,NaN
2,NaN,Inflation rate for the Consumer Price Index (C...,NaN,NaN
3,NaN,NaN,NaN,NaN
4,NaN,Jan 89,4.9,in %

In [ ]:
df_cleaned = df[['Unnamed: 1', 'Unnamed: 2']].rename(columns={'Unnamed: 1': 'date', 'Unnamed: 2': 'inflation rate'})
df_cleaned

                                                  date  inflation rate
0                                                  NaN             NaN
1                   Inflation rate in the UK 1989-2024             NaN
2    Inflation rate for the Consumer Price Index (C...             NaN
3                                                  NaN             NaN
4                                               Jan 89             4.9
..                                                 ...             ...
420                                             Sep 23             6.7
421                                             Oct 23             4.6
422                                             Nov 23             3.9
423                                             Dec 23             4.0
424                                             Jan 24             4.0

[425 rows x 2 columns]

In [ ]:
rows_to_drop = df_cleaned.index[0:4]
df_dropped = df_cleaned.drop(rows_to_drop).reset_index(drop=True)

# Check the DataFrame after dropping rows
print(df_dropped)

       date  inflation rate
0    Jan 89             4.9
1    Feb 89             5.0
2    Mar 89             5.0
3    Apr 89             5.3
4    May 89             5.3
..      ...             ...
416  Sep 23             6.7
417  Oct 23             4.6
418  Nov 23             3.9
419  Dec 23             4.0
420  Jan 24             4.0

[421 rows x 2 columns]

In [ ]:
df_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            421 non-null    object
 1   inflation rate  421 non-null    float64
dtypes: float64(1), object(1)
memory usage: 6.7+ KB

In [ ]:
df_dropped['date'] = pd.to_datetime(df_dropped['date'], format='%b %y')

# Check the conversion
print(df_dropped.head())

        date  inflation rate
0 1989-01-01             4.9
1 1989-02-01             5.0
2 1989-03-01             5.0
3 1989-04-01             5.3
4 1989-05-01             5.3

In [ ]:
df_dropped.head()

        date  inflation rate
0 1989-01-01             4.9
1 1989-02-01             5.0
2 1989-03-01             5.0
3 1989-04-01             5.3
4 1989-05-01             5.3

In [ ]:
df_dropped['date_display'] = df_dropped['date'].dt.strftime('%b %y')

In [ ]:
print(df_dropped.head())
print()
print(df_dropped.info())

        date  inflation rate date_display
0 1989-01-01             4.9       Jan 89
1 1989-02-01             5.0       Feb 89
2 1989-03-01             5.0       Mar 89
3 1989-04-01             5.3       Apr 89
4 1989-05-01             5.3       May 89

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421 entries, 0 to 420
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            421 non-null    datetime64[ns]
 1   inflation rate  421 non-null    float64
 2   date_display    421 non-null    object
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 10.0+ KB
None